---
title: ProjectLocationSet
classe: Autodesk.Revit.DB.ProjectLocationSet
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# ProjectLocationSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `projectLocationSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `projectLocationSet.Size` | Int32 |
| `Void Clear()` | `projectLocationSet.Clear()` | Void |
| `Boolean Contains(ProjectLocation)` | `projectLocationSet.Contains(item)` | Boolean |
| `Int32 Erase(ProjectLocation)` | `projectLocationSet.Erase(item)` | Int32 |
| `ProjectLocationSetIterator ForwardIterator()` | `projectLocationSet.ForwardIterator()` | ProjectLocationSetIterator |
| `IEnumerator GetEnumerator()` | `projectLocationSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(ProjectLocation)` | `projectLocationSet.Insert(item)` | Boolean |
| `ProjectLocationSetIterator ReverseIterator()` | `projectLocationSet.ReverseIterator()` | ProjectLocationSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```